{"class_name": "Functional", "config": {"name": "CVAE", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "name": "encoder_input", "inbound_nodes": [], "shared_object_id": 0}, {"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "name": "encoder_input", "inbound_nodes": [], "shared_object_id": 0}, {"class_name": "Reshape", "config": {"name": "reshape_70", "trainable": true, "dtype": "float32", "target_shape": [28, 28, 1]}, "name": "reshape_70", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_51", "inbound_nodes": [[["reshape_70", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_51", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_52", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_52", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_48", "inbound_nodes": [[["conv2d_52", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_24", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_24", "inbound_nodes": [[["dropout_48", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_72", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_72", "inbound_nodes": [[["flatten_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_mean", "inbound_nodes": [[["dense_72", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_log_var", "inbound_nodes": [[["dense_72", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "z", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABgAAAAUAAABDAAAAc0oAAAB8AFwCfQF9AnQAoAF8AaEBZAEZAH0DdACgAnwBoQFk\nAhkAfQR0AGoDfAN8BGYCZAONAX0FfAF0AKAEZAR8AhQAoQF8BRQAFwBTACkF+s5SZXBhcmFtZXRl\ncml6YXRpb24gdHJpY2sgYnkgc2FtcGxpbmcgZnIgYW4gaXNvdHJvcGljIHVuaXQgR2F1c3NpYW4u\nCgogICAgIyBBcmd1bWVudHM6CiAgICAgICAgYXJncyAodGVuc29yKTogbWVhbiBhbmQgbG9nIG9m\nIHZhcmlhbmNlIG9mIFEoenxYKQoKICAgICMgUmV0dXJuczoKICAgICAgICB6ICh0ZW5zb3IpOiBz\nYW1wbGVkIGxhdGVudCB2ZWN0b3IKICAgIOkAAAAA6QEAAAApAdoFc2hhcGXnAAAAAAAA4D8pBdoB\nS3IEAAAA2glpbnRfc2hhcGXaDXJhbmRvbV9ub3JtYWzaA2V4cCkG2gRhcmdz2gZ6X21lYW7aCXpf\nbG9nX3ZhctoFYmF0Y2jaA2RpbdoHZXBzaWxvbqkAchAAAAD6HzxpcHl0aG9uLWlucHV0LTI1LTNh\nOWFkMmY0OGVhMT7aCHNhbXBsaW5nEAAAAHMKAAAAAAkIAQ4BDgIQAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "z", "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["z_mean", 0, 0], ["z_log_var", 0, 0], ["z", 0, 0]]}, "name": "encoder", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "z_sampling"}, "name": "z_sampling", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_73", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_73", "inbound_nodes": [[["z_sampling", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_74", "trainable": true, "dtype": "float32", "units": 3136, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_74", "inbound_nodes": [[["dense_73", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_71", "trainable": true, "dtype": "float32", "target_shape": [7, 7, 64]}, "name": "reshape_71", "inbound_nodes": [[["dense_74", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_49", "inbound_nodes": [[["reshape_71", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_52", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_52", "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_transpose_52", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_53", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_53", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_72", "trainable": true, "dtype": "float32", "target_shape": [784]}, "name": "reshape_72", "inbound_nodes": [[["conv2d_transpose_53", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0]], "output_layers": [["reshape_72", 0, 0]]}, "name": "decoder", "inbound_nodes": [[["encoder", 1, 2, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_70", "trainable": true, "dtype": "float32", "target_shape": [28, 28, 1]}, "name": "reshape_70", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "shared_object_id": 1}, {"class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 3}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_51", "inbound_nodes": [[["reshape_70", 0, 0, {}]]], "shared_object_id": 4}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 6}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 7}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 8}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_51", 0, 0, {}]]], "shared_object_id": 9}, {"class_name": "Conv2D", "config": {"name": "conv2d_52", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_52", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "shared_object_id": 12}, {"class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_48", "inbound_nodes": [[["conv2d_52", 0, 0, {}]]], "shared_object_id": 13}, {"class_name": "Flatten", "config": {"name": "flatten_24", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_24", "inbound_nodes": [[["dropout_48", 0, 0, {}]]], "shared_object_id": 14}, {"class_name": "Dense", "config": {"name": "dense_72", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 15}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 16}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_72", "inbound_nodes": [[["flatten_24", 0, 0, {}]]], "shared_object_id": 17}, {"class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 21}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 22}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_log_var", "inbound_nodes": [[["dense_72", 0, 0, {}]]], "shared_object_id": 23}, {"class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 18}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 19}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "z_mean", "inbound_nodes": [[["dense_72", 0, 0, {}]]], "shared_object_id": 20}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_44", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_44", "inbound_nodes": [["_CONSTANT_VALUE", -1, 1.0, {"y": ["z_log_var", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.square_22", "trainable": true, "dtype": "float32", "function": "math.square"}, "name": "tf.math.square_22", "inbound_nodes": [["z_mean", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.cast_37", "trainable": true, "dtype": "float32", "function": "cast"}, "name": "tf.cast_37", "inbound_nodes": [["encoder_input", 0, 0, {"dtype": "float32"}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.convert_to_tensor_25", "trainable": true, "dtype": "float32", "function": "convert_to_tensor"}, "name": "tf.convert_to_tensor_25", "inbound_nodes": [["decoder", 1, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_44", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_44", "inbound_nodes": [["tf.__operators__.add_44", 0, 0, {"y": ["tf.math.square_22", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.exp_22", "trainable": true, "dtype": "float32", "function": "math.exp"}, "name": "tf.math.exp_22", "inbound_nodes": [["z_log_var", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.keras.backend.binary_crossentropy_4", "trainable": true, "dtype": "float32", "function": "keras.backend.binary_crossentropy"}, "name": "tf.keras.backend.binary_crossentropy_4", "inbound_nodes": [["tf.cast_37", 0, 0, {"output": ["tf.convert_to_tensor_25", 0, 0], "from_logits": false}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_45", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_45", "inbound_nodes": [["tf.math.subtract_44", 0, 0, {"y": ["tf.math.exp_22", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_39", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_39", "inbound_nodes": [["tf.keras.backend.binary_crossentropy_4", 0, 0, {"axis": -1, "keepdims": false}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_30", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_30", "inbound_nodes": [["tf.math.subtract_45", 0, 0, {"axis": -1, "keepdims": false}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_43", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_43", "inbound_nodes": [["tf.math.reduce_mean_39", 0, 0, {"y": 784, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_44", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_44", "inbound_nodes": [["tf.math.reduce_sum_30", 0, 0, {"y": -0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_45", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_45", "inbound_nodes": [["tf.math.multiply_43", 0, 0, {"y": ["tf.math.multiply_44", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_40", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_40", "inbound_nodes": [["tf.__operators__.add_45", 0, 0, {"axis": null, "keepdims": false}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_17", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_17", "inbound_nodes": [[["tf.math.reduce_mean_40", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.5.0", "backend": "tensorflow"}